# -4 -6 /2 ceil
# <=19

from math import *

def can_win(s, m):
    if s <= 19:
        return m % 2 == 0
    if m == 0:
        return 0

    can = [
        can_win(s - 4, m - 1),
        can_win(s - 6, m - 1),
        can_win(ceil(s / 2), m - 1),
    ]
    if (m - 1) % 2 == 0:
        return any(can)
    return all(can)

print([s for s in range(20,100) if not can_win(s, 1) and can_win(s, 2)])
print([s for s in range(20,100) if not can_win(s, 1) and can_win(s, 3)])
print([s for s in range(20,100) if not can_win(s, 2) and can_win(s, 4)])

Укажите сумму таких значений S, при которых Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

Задание 20.

Для игры, описанной в задании 19, найдите наименьшее и наибольшее значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.

Задание 21.

Для игры, описанной в задании 19, найдите сумму таких значений S, при которых одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.